[
    {
        "id": 1,
        "title": "Jersey - RESTful Web Services in Java",
        "description": "Developing RESTful Web services that seamlessly support exposing your data in a variety of representation media types and abstract away the low-level details of the client-server communication is not an easy task without a good toolkit. In order to simplify development of RESTful Web services and their clients in Java, a standard and portable JAX-RS API has been designed. Jersey RESTful Web Services framework is open source, production quality, framework for developing RESTful Web Services in Java that provides support for JAX-RS APIs and serves as a JAX-RS (JSR 311 & JSR 339) Reference Implementation.",
        "url": "https://jersey.java.net/",
        "imageUrl": "https://jersey.java.net/images/jersey_logo.png",
        "submittedBy": "hhe",
        "submittedOn": "20140614",
        "votes": 0,
        "tags": ["Java", "REST", "JAX-RS"],
        "numberOfComments": 2
    },
    {
        "id": 2,
        "title": "FasterXML/jackson",
        "description": "Jackson is a suite of data-processing tools for Java (and JVM platform), including the flagship JSON parsing and generation library, as well as additional modules to process data encoded in Avro, CBOR, CSV, Smile, XML or YAML (and list of supported format is still growing!)",
        "url": "https://github.com/FasterXML/jackson",
        "imageUrl": "http://fasterxml.com/images/fxml_logo.png",
        "submittedBy": "aho",
        "submittedOn": "20140615",
        "votes": 0,
        "tags": ["Java", "JSON"],
        "numberOfComments": 2
    },
    {
        "id": 3,
        "title": "Eclipse Scout",
        "description": "Eclipse Scout is a mature and open framework for modern, service oriented business applications. It substantially boosts developer productivity and is simple to learn.",
        "url": "https://www.eclipse.org/scout/",
        "imageUrl": "http://www.bsiag.com/scout/wp-content/themes/bsi_new/images/header1.png",
        "submittedBy": "aho",
        "submittedOn": "20140616",
        "votes": 2,
        "tags": ["Scout", "Eclipse Scout", "Eclipse"],
        "numberOfComments": 3
    }
]